-- borrowing_statuses
-- Статус самого borrowing
INSERT INTO borrowing_statuses (name) VALUES
('active'),
('returned'),
('overdue'),
('lost'),
('reserved'),
('cancelled'),
('renewed'),
('pending'),
('damaged'),
('closed');


-- borrowings
-- Список всіх видач в бібліотеці, користувач може мати декілька, як і різні статуси
INSERT INTO borrowings (member_id, borrowing_date, status_id) VALUES
(1, '2025-01-10 10:15:00', 2),
(1, '2025-01-10 10:15:00', 4),
(2, '2025-01-10 10:15:00', 2),
(2, '2025-01-15 14:20:00', 1),
(3, '2025-02-01 09:00:00', 3),
(4, '2025-02-10 16:45:00', 2),
(5, '2025-03-05 11:30:00', 1),
(6, '2025-03-12 13:15:00', 4),
(7, '2025-04-01 08:40:00', 2),
(8, '2025-04-18 17:00:00', 1),
(9, '2025-05-02 12:25:00', 3),
(10, '2025-05-20 15:50:00', 1);


-- borrowing_items
-- В одній видачі у користувача може бути декілька книг
INSERT INTO borrowing_items (
    borrowing_id,
    book_copy_id,
    return_date,
    due_date
) VALUES
(1, 1, '2025-01-20 12:00:00', '2025-01-24 23:59:59'),
(2, 2, NULL, '2025-06-20 23:59:59'),
(3, 3, NULL, '2025-02-15 23:59:59'),
(4, 4, '2025-02-18 10:00:00', '2025-02-24 23:59:59'),
(5, 5, NULL, '2025-06-25 23:59:59'),
(6, 6, NULL, '2025-03-26 23:59:59'),
(7, 7, '2025-04-10 15:00:00', '2025-04-15 23:59:59'),
(8, 8, NULL, '2025-07-02 23:59:59'),
(9, 9, NULL, '2025-05-16 23:59:59'),
(10, 10, NULL, '2025-07-15 23:59:59');
